app/Services/ProfileService.php

SELECT *
FROM `users`
WHERE `users`.`id` = 1
---
    public function getProfile(int $userId): ?array
    {
        $user = $this->userModel->find($userId);