app/Controllers/AdmissionController.php

SELECT `admissions`.*, `patients`.`first_name` AS `patient_first_name`, `patients`.`last_name` AS `patient_last_name`, `doctors`.`first_name` AS `doctor_first_name`, `doctors`.`last_name` AS `doctor_last_name`, `wards`.`name` AS `ward_name`
FROM `admissions`
LEFT JOIN `patients` ON `patients`.`patient_id` = `admissions`.`patient_id`
LEFT JOIN `doctors` ON `doctors`.`doctor_id` = `admissions`.`assigned_doctor_id`
LEFT JOIN `wards` ON `wards`.`id` = `admissions`.`ward_id`
ORDER BY `admissions`.`admission_date` DESC
---
    public function index()
    {
        if ($redirect = $this->enforceRoles(['admin', 'doctor', 'nurse', 'receptionist'])) {
            return $redirect;
        }

        $user = session()->get('user');
        $branchId = $user['branch_id'] ?? null;
        $isGlobal = $user && (empty($branchId) || $user['role'] === 'admin');

        $status = $this->request->getGet('status');

        $builder = $this->admissionModel->builder();
        $builder->select('admissions.*, '
            . 'patients.first_name AS patient_first_name, patients.last_name AS patient_last_name, '
            . 'doctors.first_name AS doctor_first_name, doctors.last_name AS doctor_last_name, '
            . 'wards.name AS ward_name');
        $builder->join('patients', 'patients.patient_id = admissions.patient_id', 'left');
        $builder->join('doctors', 'doctors.doctor_id = admissions.assigned_doctor_id', 'left');
        $builder->join('wards', 'wards.id = admissions.ward_id', 'left');

        if (! $isGlobal && $branchId) {
            $builder->where('admissions.branch_id', $branchId);
        }

        if ($status) {
            $builder->where('admissions.status', $status);
        }

        $admissions = $builder
            ->orderBy('admissions.admission_date', 'DESC')
            ->get()
            ->getResultArray();