app/Controllers/DashboardController.php

SELECT COUNT(*) AS `numrows` FROM `patients`
SELECT COUNT(*) AS `numrows` FROM `doctors`
---
    public function index()
    {
        $user = session()->get('user');

        if (!$user) {
            return redirect()->to('/login');
        }

        $branchId = $user['branch_id'] ?? null;
        $isGlobal = $user && (empty($branchId) || $user['role'] === 'admin');

        $patientModel     = new PatientModel();
        $doctorModel      = new DoctorModel();
        $appointmentModel = new AppointmentModel();
        $admissionModel   = new AdmissionModel();
        $medicineModel    = new MedicineModel();
        $invoiceModel     = new InvoiceModel();

        if ($isGlobal || ! $branchId) {
            $totalPatients = $patientModel->countAll();
        } else {
            $totalPatients = $patientModel->where('branch_id', $branchId)->countAllResults();
        }

        if ($isGlobal || ! $branchId) {
            $totalDoctors = $doctorModel->countAll();

SELECT COUNT(*) AS `numrows` FROM `appointments`
SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE DATE(scheduled_at) = '2025-11-26'
---
        }

        if ($isGlobal || ! $branchId) {
            $totalAppointments = $appointmentModel->countAll();
            $todayAppointments = $appointmentModel
                ->where('DATE(scheduled_at)', date('Y-m-d'))
                ->countAllResults();