app/Controllers/MedicineController.php

    public function index()
    {
        if ($redirect = $this->enforceRoles(['admin', 'pharmacist'])) {
            return $redirect;
        }

        $user = session()->get('user');
        $branchId = $user['branch_id'] ?? null;
        $isGlobal = $user && (empty($branchId) || $user['role'] === 'admin');

        $search = $this->request->getGet('search');

        $builder = $this->medicineModel;

        if (! $isGlobal && $branchId) {
            $builder = $builder->where('branch_id', $branchId);
        }

        if ($search) {
            $builder = $builder
                ->groupStart()
                ->like('name', $search)
                ->orLike('sku', $search)
                ->orLike('batch_number', $search)
                ->groupEnd();
        }

        $medicines = $builder->orderBy('name', 'ASC')->findAll();
---
SELECT *
FROM `medicines`
ORDER BY `name` ASC