app/Controllers/PatientController.php

SELECT *
FROM `patients`
---
    public function index()
    {
        $search = $this->request->getGet('search');

        if ($search) {
            $patients = $this->patientModel
                ->like('first_name', $search)
                ->orLike('last_name', $search)
                ->orLike('phone', $search)
                ->orLike('email', $search)
                ->findAll();
        } else {
            $patients = $this->patientModel->findAll();