app/Controllers/ReportsController.php

    public function financial()
    {
        if ($redirect = $this->enforceRoles(['admin'])) {
            return $redirect;
        }

        $filters = [
            'date_from' => $this->request->getGet('date_from') ?? date('Y-m-01'),
            'date_to' => $this->request->getGet('date_to') ?? date('Y-m-d'),
            'branch_id' => $this->request->getGet('branch_id'),
            'report_type' => $this->request->getGet('report_type') ?? 'summary'
        ];

        $data = $this->generateFinancialReport($filters);

        return view('reports/financial', [
            'data' => $data,
            'filters' => $filters,
            'branches' => $this->branchModel->findAll()
---
SELECT *
FROM `branches`

    public function patient()
    {
        if ($redirect = $this->enforceRoles(['admin', 'doctor', 'receptionist'])) {
            return $redirect;
        }

        $filters = [
            'date_from' => $this->request->getGet('date_from') ?? date('Y-m-01'),
            'date_to' => $this->request->getGet('date_to') ?? date('Y-m-d'),
            'branch_id' => $this->request->getGet('branch_id'),
            'report_type' => $this->request->getGet('report_type') ?? 'demographics'
        ];

        $data = $this->generatePatientReport($filters);

        return view('reports/patient', [
            'data' => $data,
            'filters' => $filters,
            'branches' => $this->branchModel->findAll()
---
SELECT *
FROM `branches`