app/Controllers/UserController.php

SELECT *
FROM `users`
ORDER BY `id` ASC
---
    public function index()
    {
        if ($redirect = $this->enforceRoles(['admin'])) {
            return $redirect;
        }

        $users = $this->userModel
            ->orderBy('id', 'ASC')
            ->findAll();