app/Models/InvoiceModel.php

    public function getUnpaidInvoices($branchId = null)
    {
        $builder = $this->whereIn('status', ['unpaid', 'partially_paid']);

        if ($branchId) {
            $builder = $builder->where('branch_id', $branchId);
        }

        return $builder->findAll();
---
SELECT *
FROM `invoices`
WHERE `status` IN ('unpaid','partially_paid')

    public function getDailyRevenue(array $filters = []): array
    {
        $builder = $this->builder()
            ->select('
                DATE(created_at) as date,
                COUNT(*) as invoice_count,
                SUM(total_amount) as revenue,
                SUM(CASE WHEN status = "paid" THEN total_amount ELSE 0 END) as paid_revenue
            ')
            ->groupBy('DATE(created_at)')
            ->orderBy('date', 'DESC');

        if (!empty($filters['date_from'])) {
            $builder->where('DATE(created_at) >=', $filters['date_from']);
        }

        if (!empty($filters['date_to'])) {
            $builder->where('DATE(created_at) <=', $filters['date_to']);
        }

        if (!empty($filters['branch_id'])) {
            $builder->where('branch_id', $filters['branch_id']);
        }

        $results = $builder->get()->getResultArray();
---
SELECT DATE(created_at) as date, COUNT(*) as invoice_count, SUM(total_amount) as revenue, SUM(CASE WHEN status = "paid" THEN total_amount ELSE 0 END) as paid_revenue
FROM `invoices`
WHERE DATE(created_at) >= '2025-11-01'
AND DATE(created_at) <= '2025-11-29'
GROUP BY DATE(created_at)
ORDER BY `date` DESC

    public function getPaymentMethodsSummary(array $filters = []): array
    {
        // Since invoices table doesn't have payment_method column in the current structure,
        // we'll return a basic summary. In a real implementation, this would come from a payments table.
        $builder = $this->builder()
            ->select('
                status as payment_method,
                COUNT(*) as count,
                SUM(total_amount) as total_amount
            ')
            ->groupBy('status');

        if (!empty($filters['date_from'])) {
            $builder->where('DATE(created_at) >=', $filters['date_from']);
        }

        if (!empty($filters['date_to'])) {
            $builder->where('DATE(created_at) <=', $filters['date_to']);
        }

        if (!empty($filters['branch_id'])) {
            $builder->where('branch_id', $filters['branch_id']);
        }

        $results = $builder->get()->getResultArray();
---
SELECT `status` as `payment_method`, COUNT(*) as count, SUM(total_amount) as total_amount
FROM `invoices`
WHERE DATE(created_at) >= '2025-11-01'
AND DATE(created_at) <= '2025-11-29'
GROUP BY `status`