app/Models/MedicineModel.php

    public function getLowStockMedicines($branchId = null)
    {
        $builder = $this->where('stock_quantity <=', 'min_stock_threshold', false);

        if ($branchId) {
            $builder = $builder->where('branch_id', $branchId);
        }

        return $builder->findAll();
---
SELECT *
FROM `medicines`
WHERE stock_quantity <= min_stock_threshold

    public function getExpiringMedicines($days = 30, $branchId = null)
    {
        $date = date('Y-m-d', strtotime("+{$days} days"));

        $builder = $this->where('expiry_date <=', $date);

        if ($branchId) {
            $builder = $builder->where('branch_id', $branchId);
        }

        return $builder->findAll();
---
SELECT *
FROM `medicines`
WHERE `expiry_date` <= '2025-12-26'