app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'admin@hospital.com'
 LIMIT 1
---
    public function verifyCredentials($email, $password)
    {
        $user = $this->where('email', $email)->first();