app/Models/UserProfileModel.php

SELECT *
FROM `user_profiles`
WHERE `user_id` = 1
 LIMIT 1
---
    public function getProfileByUserId(int $userId): ?array
    {
        $profile = $this->where('user_id', $userId)->first();